orgs/openclaw3.org
#+title: OpenClaw 设计细节（三）：会话管理、定时任务、节点系统、配置系统
#+date: Thu Feb 19 18:30:07 2026
#+author: Zi Liang
#+email: zi1415926.liang@connect.polyu.hk
#+latex_class: elegantpaper
#+filetags: ::

* 第九章 会话管理系统

这一章我们来聊聊 OpenClaw 的会话管理系统。会话（Session）是用户和 AI 对话的基本单位——你和 AI 的每一次对话链，都会对应一个 session。

** 9.1 会话的基本概念

在 OpenClaw 里，session 不是简单的内存对象，而是持久化到磁盘的。让我们看看核心数据结构：

#+BEGIN_SRC typescript
// src/config/sessions/types.ts 相关定义
export type SessionEntry = {
  sessionId: string;
  sessionFile?: string;
  updatedAt: number;
  systemSent?: boolean;
  abortedLastRun?: boolean;
  thinkingLevel?: string;
  verboseLevel?: string;
  reasoningLevel?: string;
  ttsAuto?: TtsAutoMode;
  modelOverride?: string;
  providerOverride?: string;
  totalTokens?: number;
  inputTokens?: number;
  outputTokens?: number;
  contextTokens?: number;
  compactionCount?: number;
  // ... 更多字段
};
#+END_SRC

每个会话都有：
- =sessionId=：唯一标识符（UUID）
- =sessionFile=：会话记录文件路径（JSONL 格式）
- =updatedAt=：最后更新时间戳
- =thinkingLevel=、=verboseLevel=、=reasoningLevel=：用户设置的偏好
- =modelOverride=、=providerOverride=：模型覆盖设置
- =totalTokens= 等：token 使用统计
- =compactionCount=：会话压缩次数（历史消息压缩）

** 9.2 会话文件存储

会话记录不是存在数据库里，而是直接存 JSONL 文件。这个设计挺有意思的：

#+BEGIN_SRC typescript
// src/config/sessions/paths.ts 节选
export function resolveSessionTranscriptPath(
  sessionId: string,
  agentId: string,
  threadId?: string | null,
): string {
  const sessionsDir = ensureSessionsDir(agentId);
  const timestamp = new Date().toISOString().replace(/[:.]/g, "-");
  return path.join(sessionsDir, `${timestamp}_${sessionId}.jsonl`);
}
#+END_SRC

文件名格式是 ={timestamp}_{sessionId}.jsonl=，比如：
=2026-02-19T10-30-00-000Z_a1b2c3d4.jsonl=

JSONL 格式的好处是：
1. 可以增量写入（append-only）
2. 损坏了容易修复（一行一行解析）
3. 可以直接用文本编辑器查看

** 9.3 会话初始化流程

我翻了一下 =src/auto-reply/reply/session.ts=，里面的 =initSessionState= 函数是会话初始化的核心，有 470 多行！让我们梳理一下主要流程：

1. **确定目标会话 key**：区分普通消息和原生 slash 命令
2. **加载 session store**：从磁盘读取会话索引
3. **检查重置触发器**：比如 =/new=、=/reset= 命令
4. **计算会话新鲜度**：判断是否需要新建会话
5. **构建 session entry**：合并旧状态和新设置
6. **持久化到 store**：更新会话索引文件
7. **触发插件钩子**：=session_start=、=session_end=

让我们看看重置触发器的逻辑：

#+BEGIN_SRC typescript
// src/auto-reply/reply/session.ts 节选
const DEFAULT_RESET_TRIGGERS = ["/new", "/reset", "/clear"];

// 检查是否触发重置
for (const trigger of resetTriggers) {
  if (!trigger) continue;
  if (!resetAuthorized) break;

  const triggerLower = trigger.toLowerCase();
  if (trimmedBodyLower === triggerLower || strippedForResetLower === triggerLower) {
    isNewSession = true;
    bodyStripped = "";
    resetTriggered = true;
    break;
  }
  // 支持 "/new 你好" 这种格式
  const triggerPrefixLower = `${triggerLower} `;
  if (trimmedBodyLower.startsWith(triggerPrefixLower) ||
      strippedForResetLower.startsWith(triggerPrefixLower)) {
    isNewSession = true;
    bodyStripped = strippedForReset.slice(trigger.length).trimStart();
    resetTriggered = true;
    break;
  }
}
#+END_SRC

** 9.4 会话作用域（Scope）

会话的 scope 决定了什么情况下共享同一个会话。有几种模式：

- =per-sender=：每个发送者独立会话（默认）
- =per-channel=：整个频道共享一个会话
- =per-group=：群组内共享会话

配置在 =config.session.scope=：

#+BEGIN_SRC typescript
// src/config/sessions/session-key.ts
export function resolveSessionKey(
  scope: SessionScope,
  ctx: MsgContext,
  mainKey: string | null,
): string {
  switch (scope) {
    case "per-channel":
      return `${ctx.Provider}:${ctx.OriginatingChannel}:${ctx.To}:${mainKey ?? "default"}`;
    case "per-group":
      // ... 群组逻辑
    case "per-sender":
    default:
      return `${ctx.Provider}:${ctx.OriginatingChannel}:${ctx.From}:${mainKey ?? "default"}`;
  }
}
#+END_SRC

** 9.5 会话重置策略

会话不是永远存在的，可以根据时间自动重置。策略包括：

- =never=：从不自动重置
- =after=：指定时间后重置
- =daily=：每天重置
- =weekly=：每周重置

#+BEGIN_SRC typescript
// src/config/sessions/reset.ts
export function evaluateSessionFreshness(params: {
  updatedAt: number;
  now: number;
  policy: SessionResetPolicy;
}): { fresh: boolean; reason?: string } {
  // 检查会话是否还"新鲜"
  // fresh: true → 继续用旧会话
  // fresh: false → 创建新会话
}
#+END_SRC

** 9.6 会话分叉（Fork）

OpenClaw 支持从父会话分叉出子会话，继承历史消息：

#+BEGIN_SRC typescript
// src/auto-reply/reply/session.ts 节选
function forkSessionFromParent(params: {
  parentEntry: SessionEntry;
  agentId: string;
  sessionsDir: string;
}): { sessionId: string; sessionFile: string } | null {
  const parentSessionFile = resolveSessionFilePath(...);
  const manager = SessionManager.open(parentSessionFile);
  const leafId = manager.getLeafId();

  if (leafId) {
    const sessionFile = manager.createBranchedSession(leafId);
    const sessionId = manager.getSessionId();
    return { sessionId, sessionFile };
  }
  // ...
}
#+END_SRC

这个功能是通过 @mariozechner/pi-coding-agent 库实现的，我们后面再说。

** 9.7 会话压缩（Compaction）

随着对话进行，会话历史会越来越长。OpenClaw 会定期压缩历史消息，避免上下文溢出：

- =compactionCount=：记录压缩次数
- =memoryFlushCompactionCount=：记忆刷新时的压缩计数
- =memoryFlushAt=：记忆刷新时间戳

压缩逻辑会把旧的对话消息合并成摘要，节省 token。

* 第10章 定时任务系统（Cron）

OpenClaw 有一个完整的定时任务系统，可以让 AI 在指定时间自动执行任务。比如：
- 每天早上 9 点提醒天气
- 每小时检查一次服务器状态
- 每周生成周报

** 10.1 定时任务类型

定时任务支持三种调度方式：

1. **Cron 表达式**：标准 cron 格式（=* * * * *=）
2. **固定间隔**：每 X 毫秒执行一次
3. **一次性执行**：在指定时间点执行一次

#+BEGIN_SRC typescript
// src/cron/types.ts
export type CronSchedule =
  | { kind: "cron"; expr: string; tz?: string }
  | { kind: "every"; everyMs: number; anchorMs?: number }
  | { kind: "at"; at: string };
#+END_SRC

