docs/openclaw3.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-04-01 Wed 13:41 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OpenClaw 设计细节（三）：会话管理、定时任务、节点系统、配置系统</title>
<meta name="author" content="Zi Liang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/styles.css" /> <link rel="stylesheet" type="text/css" href="/css/htmlize.css" /></head>
<body>
<div id="preamble" class="status">
<nav class="nav"> <a href="/index.html" class="button">Home</a> <a href="/about.html" class="button">About</a> <a href="/sitemap.html" class="button">Sitemaps</a> </nav> <hr>
</div>
<div id="content" class="content">
<h1 class="title">OpenClaw 设计细节（三）：会话管理、定时任务、节点系统、配置系统</h1>
<div id="outline-container-orgc193ffc" class="outline-2">
<h2 id="orgc193ffc"><span class="section-number-2">1.</span> 第九章 会话管理系统</h2>
<div class="outline-text-2" id="text-1">
<p>
这一章我们来聊聊 OpenClaw 的会话管理系统。会话（Session）是用户和 AI 对话的基本单位——你和 AI 的每一次对话链，都会对应一个 session。
</p>
</div>
<div id="outline-container-orgcc05fe8" class="outline-3">
<h3 id="orgcc05fe8"><span class="section-number-3">1.1.</span> 9.1 会话的基本概念</h3>
<div class="outline-text-3" id="text-1-1">
<p>
在 OpenClaw 里，session 不是简单的内存对象，而是持久化到磁盘的。让我们看看核心数据结构：
</p>

<div class="org-src-container">
<pre class="src src-typescript">// src/config/sessions/types.ts 相关定义
export type SessionEntry = {
  sessionId: string;
  sessionFile?: string;
  updatedAt: number;
  systemSent?: boolean;
  abortedLastRun?: boolean;
  thinkingLevel?: string;
  verboseLevel?: string;
  reasoningLevel?: string;
  ttsAuto?: TtsAutoMode;
  modelOverride?: string;
  providerOverride?: string;
  totalTokens?: number;
  inputTokens?: number;
  outputTokens?: number;
  contextTokens?: number;
  compactionCount?: number;
  // ... 更多字段
};
</pre>
</div>

<p>
每个会话都有：
</p>
<ul class="org-ul">
<li>=sessionId=：唯一标识符（UUID）</li>
<li>=sessionFile=：会话记录文件路径（JSONL 格式）</li>
<li>=updatedAt=：最后更新时间戳</li>
<li>=thinkingLevel=、=verboseLevel=、=reasoningLevel=：用户设置的偏好</li>
<li>=modelOverride=、=providerOverride=：模型覆盖设置</li>
<li><code>totalTokens</code> 等：token 使用统计</li>
<li>=compactionCount=：会话压缩次数（历史消息压缩）</li>
</ul>
</div>
</div>
<div id="outline-container-org0e74ce7" class="outline-3">
<h3 id="org0e74ce7"><span class="section-number-3">1.2.</span> 9.2 会话文件存储</h3>
<div class="outline-text-3" id="text-1-2">
<p>
会话记录不是存在数据库里，而是直接存 JSONL 文件。这个设计挺有意思的：
</p>

<div class="org-src-container">
<pre class="src src-typescript">// src/config/sessions/paths.ts 节选
export function resolveSessionTranscriptPath(
  sessionId: string,
  agentId: string,
  threadId?: string | null,
): string {
  const sessionsDir = ensureSessionsDir(agentId);
  const timestamp = new Date().toISOString().replace(/[:.]/g, "-");
  return path.join(sessionsDir, `${timestamp}_${sessionId}.jsonl`);
}
</pre>
</div>

<p>
文件名格式是 <code>{timestamp}_{sessionId}.jsonl=，比如：
=2026-02-19T10-30-00-000Z_a1b2c3d4.jsonl</code>
</p>

<p>
JSONL 格式的好处是：
</p>
<ol class="org-ol">
<li>可以增量写入（append-only）</li>
<li>损坏了容易修复（一行一行解析）</li>
<li>可以直接用文本编辑器查看</li>
</ol>
</div>
</div>
<div id="outline-container-org3613021" class="outline-3">
<h3 id="org3613021"><span class="section-number-3">1.3.</span> 9.3 会话初始化流程</h3>
<div class="outline-text-3" id="text-1-3">
<p>
我翻了一下 <code>src/auto-reply/reply/session.ts=，里面的 =initSessionState</code> 函数是会话初始化的核心，有 470 多行！让我们梳理一下主要流程：
</p>

<ol class="org-ol">
<li>**确定目标会话 key**：区分普通消息和原生 slash 命令</li>
<li>**加载 session store**：从磁盘读取会话索引</li>
<li>**检查重置触发器**：比如 <code>/new=、=/reset</code> 命令</li>
<li>**计算会话新鲜度**：判断是否需要新建会话</li>
<li>**构建 session entry**：合并旧状态和新设置</li>
<li>**持久化到 store**：更新会话索引文件</li>
<li>**触发插件钩子**：=session_start=、=session_end=</li>
</ol>

<p>
让我们看看重置触发器的逻辑：
</p>

<div class="org-src-container">
<pre class="src src-typescript">// src/auto-reply/reply/session.ts 节选
const DEFAULT_RESET_TRIGGERS = ["/new", "/reset", "/clear"];

// 检查是否触发重置
for (const trigger of resetTriggers) {
  if (!trigger) continue;
  if (!resetAuthorized) break;

  const triggerLower = trigger.toLowerCase();
  if (trimmedBodyLower === triggerLower || strippedForResetLower === triggerLower) {
    isNewSession = true;
    bodyStripped = "";
    resetTriggered = true;
    break;
  }
  // 支持 "/new 你好" 这种格式
  const triggerPrefixLower = `${triggerLower} `;
  if (trimmedBodyLower.startsWith(triggerPrefixLower) ||
      strippedForResetLower.startsWith(triggerPrefixLower)) {
    isNewSession = true;
    bodyStripped = strippedForReset.slice(trigger.length).trimStart();
    resetTriggered = true;
    break;
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd964ee4" class="outline-3">
<h3 id="orgd964ee4"><span class="section-number-3">1.4.</span> 9.4 会话作用域（Scope）</h3>
<div class="outline-text-3" id="text-1-4">
<p>
会话的 scope 决定了什么情况下共享同一个会话。有几种模式：
</p>

<ul class="org-ul">
<li>=per-sender=：每个发送者独立会话（默认）</li>
<li>=per-channel=：整个频道共享一个会话</li>
<li>=per-group=：群组内共享会话</li>
</ul>

<p>
配置在 =config.session.scope=：
</p>

<div class="org-src-container">
<pre class="src src-typescript">// src/config/sessions/session-key.ts
export function resolveSessionKey(
  scope: SessionScope,
  ctx: MsgContext,
  mainKey: string | null,
): string {
  switch (scope) {
    case "per-channel":
      return `${ctx.Provider}:${ctx.OriginatingChannel}:${ctx.To}:${mainKey ?? "default"}`;
    case "per-group":
      // ... 群组逻辑
    case "per-sender":
    default:
      return `${ctx.Provider}:${ctx.OriginatingChannel}:${ctx.From}:${mainKey ?? "default"}`;
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaa86792" class="outline-3">
<h3 id="orgaa86792"><span class="section-number-3">1.5.</span> 9.5 会话重置策略</h3>
<div class="outline-text-3" id="text-1-5">
<p>
会话不是永远存在的，可以根据时间自动重置。策略包括：
</p>

<ul class="org-ul">
<li>=never=：从不自动重置</li>
<li>=after=：指定时间后重置</li>
<li>=daily=：每天重置</li>
<li>=weekly=：每周重置</li>
</ul>

<div class="org-src-container">
<pre class="src src-typescript">// src/config/sessions/reset.ts
export function evaluateSessionFreshness(params: {
  updatedAt: number;
  now: number;
  policy: SessionResetPolicy;
}): { fresh: boolean; reason?: string } {
  // 检查会话是否还"新鲜"
  // fresh: true → 继续用旧会话
  // fresh: false → 创建新会话
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org63cae03" class="outline-3">
<h3 id="org63cae03"><span class="section-number-3">1.6.</span> 9.6 会话分叉（Fork）</h3>
<div class="outline-text-3" id="text-1-6">
<p>
OpenClaw 支持从父会话分叉出子会话，继承历史消息：
</p>

<div class="org-src-container">
<pre class="src src-typescript">// src/auto-reply/reply/session.ts 节选
function forkSessionFromParent(params: {
  parentEntry: SessionEntry;
  agentId: string;
  sessionsDir: string;
}): { sessionId: string; sessionFile: string } | null {
  const parentSessionFile = resolveSessionFilePath(...);
  const manager = SessionManager.open(parentSessionFile);
  const leafId = manager.getLeafId();

  if (leafId) {
    const sessionFile = manager.createBranchedSession(leafId);
    const sessionId = manager.getSessionId();
    return { sessionId, sessionFile };
  }
  // ...
}
</pre>
</div>

<p>
这个功能是通过 @mariozechner/pi-coding-agent 库实现的，我们后面再说。
</p>
</div>
</div>
<div id="outline-container-org969de80" class="outline-3">
<h3 id="org969de80"><span class="section-number-3">1.7.</span> 9.7 会话压缩（Compaction）</h3>
<div class="outline-text-3" id="text-1-7">
<p>
随着对话进行，会话历史会越来越长。OpenClaw 会定期压缩历史消息，避免上下文溢出：
</p>

<ul class="org-ul">
<li>=compactionCount=：记录压缩次数</li>
<li>=memoryFlushCompactionCount=：记忆刷新时的压缩计数</li>
<li>=memoryFlushAt=：记忆刷新时间戳</li>
</ul>

<p>
压缩逻辑会把旧的对话消息合并成摘要，节省 token。
</p>
</div>
</div>
</div>
<div id="outline-container-org6a7c50b" class="outline-2">
<h2 id="org6a7c50b"><span class="section-number-2">2.</span> 第10章 定时任务系统（Cron）</h2>
<div class="outline-text-2" id="text-2">
<p>
OpenClaw 有一个完整的定时任务系统，可以让 AI 在指定时间自动执行任务。比如：
</p>
<ul class="org-ul">
<li>每天早上 9 点提醒天气</li>
<li>每小时检查一次服务器状态</li>
<li>每周生成周报</li>
</ul>
</div>
<div id="outline-container-orgbe4334f" class="outline-3">
<h3 id="orgbe4334f"><span class="section-number-3">2.1.</span> 10.1 定时任务类型</h3>
<div class="outline-text-3" id="text-2-1">
<p>
定时任务支持三种调度方式：
</p>

<ol class="org-ol">
<li><b>*Cron 表达式**：标准 cron 格式（=</b> * * * *=）</li>
<li>**固定间隔**：每 X 毫秒执行一次</li>
<li>**一次性执行**：在指定时间点执行一次</li>
</ol>

<div class="org-src-container">
<pre class="src src-typescript">// src/cron/types.ts
export type CronSchedule =
  | { kind: "cron"; expr: string; tz?: string }
  | { kind: "every"; everyMs: number; anchorMs?: number }
  | { kind: "at"; at: string };
</pre>
</div>
</div>
</div>
