orgs/openclaw3.org
** 10.2 调度计算

我看了 =src/cron/schedule.ts=，里面的 =computeNextRunAtMs= 函数负责计算下次执行时间：

#+BEGIN_SRC typescript
// src/cron/schedule.ts
export function computeNextRunAtMs(
  schedule: CronSchedule,
  nowMs: number
): number | undefined {
  if (schedule.kind === "at") {
    // 一次性任务：解析时间，检查是否在未来
    const atMs = parseAbsoluteTimeMs(schedule.at);
    return atMs > nowMs ? atMs : undefined;
  }

  if (schedule.kind === "every") {
    // 固定间隔：计算下一个间隔点
    const everyMs = Math.max(1, Math.floor(schedule.everyMs));
    const anchor = Math.max(0, Math.floor(schedule.anchorMs ?? nowMs));
    if (nowMs < anchor) return anchor;
    const elapsed = nowMs - anchor;
    const steps = Math.max(1, Math.floor((elapsed + everyMs - 1) / everyMs));
    return anchor + steps * everyMs;
  }

  // Cron 表达式：用 croner 库解析
  const expr = schedule.expr.trim();
  const cron = new Cron(expr, {
    timezone: resolveCronTimezone(schedule.tz),
    catch: false,
  });
  const nowSecondMs = Math.floor(nowMs / 1000) * 1000;
  const next = cron.nextRun(new Date(nowSecondMs));
  const nextMs = next?.getTime();
  return Number.isFinite(nextMs) && nextMs > nowSecondMs ? nextMs : undefined;
}
#+END_SRC

注意那个 timezone 处理——cron 任务支持时区，这很重要。

** 10.3 Cron 服务架构

CronService 是定时任务的核心类：

#+BEGIN_SRC typescript
// src/cron/service.ts
export class CronService {
  private readonly state;

  constructor(deps: CronServiceDeps) {
    this.state = createCronServiceState(deps);
  }

  async start() { await ops.start(this.state); }
  stop() { ops.stop(this.state); }
  async status() { return await ops.status(this.state); }
  async list(opts?: { includeDisabled?: boolean }) {
    return await ops.list(this.state, opts);
  }
  async add(input: CronJobCreate) { return await ops.add(this.state, input); }
  async update(id: string, patch: CronJobPatch) {
    return await ops.update(this.state, id, patch);
  }
  async remove(id: string) { return await ops.remove(this.state, id); }
  async run(id: string, mode?: "due" | "force") {
    return await ops.run(this.state, id, mode);
  }
  wake(opts: { mode: "now" | "next-heartbeat"; text: string }) {
    return ops.wakeNow(this.state, opts);
  }
}
#+END_SRC

设计很清晰：
- =state=：封装内部状态
- =ops=：具体操作函数（start/stop/list/add/update/remove/run）
- 分离关注点，状态和操作分开

** 10.4 定时任务的数据结构

#+BEGIN_SRC typescript
// src/cron/types.ts
export type CronJob = {
  id: string;
  name?: string;
  description?: string;
  schedule: CronSchedule;
  nextRunAtMs?: number;
  lastRunAtMs?: number;
  lastError?: string;
  enabled: boolean;
  createdAtMs: number;
  updatedAtMs: number;
  // 任务内容
  agentId?: string;
  prompt?: string;
  // ...
};
#+END_SRC

任务触发时，会创建一个隔离的 agent session，执行指定的 prompt。

** 10.5 Gateway 集成

Cron 服务通过 Gateway 暴露 API：

- =src/gateway/server-cron.ts=：HTTP 端点
- =src/gateway/server-methods/cron.ts=：方法处理
- =src/gateway/protocol/schema/cron.ts=：协议 schema

还有专门的 CLI：=src/cli/cron-cli.ts=

* 第11章 节点系统（Nodes）

Node 系统是 OpenClaw 一个很有意思的设计——它允许远程设备（比如手机、平板）连接到 OpenClaw，提供额外的能力。

** 11.1 什么是 Node？

Node 是通过 WebSocket 连接到 Gateway 的远程客户端，可以：
- 提供本地功能（摄像头、屏幕、麦克风）
- 执行本地命令
- 推送事件给 OpenClaw

比如你有个手机 App 连到 OpenClaw，AI 就可以通过这个 Node 调用手机摄像头拍照。

** 11.2 Node 注册表

NodeRegistry 管理所有连接的节点：

#+BEGIN_SRC typescript
// src/gateway/node-registry.ts
export class NodeRegistry {
  private nodesById = new Map<string, NodeSession>();
  private nodesByConn = new Map<string, string>();
  private pendingInvokes = new Map<string, PendingInvoke>();

  // 注册新节点
  register(client: GatewayWsClient, opts: { remoteIp?: string }) {
    const nodeId = connect.device?.id ?? connect.client.id;
    const session: NodeSession = {
      nodeId,
      connId: client.connId,
      client,
      displayName: connect.client.displayName,
      platform: connect.client.platform,
      version: connect.client.version,
      caps: Array.isArray(connect.caps) ? connect.caps : [],
      commands: Array.isArray((connect as { commands?: string[] }).commands)
        ? ((connect as { commands?: string[] }).commands ?? [])
        : [],
      permissions: (connect as { permissions?: Record<string, boolean> }).permissions,
      pathEnv: (connect as { pathEnv?: string }).pathEnv,
      connectedAtMs: Date.now(),
    };
    this.nodesById.set(nodeId, session);
    this.nodesByConn.set(client.connId, nodeId);
    return session;
  }

  // 注销节点
  unregister(connId: string): string | null {
    const nodeId = this.nodesByConn.get(connId);
    if (!nodeId) return null;
    this.nodesByConn.delete(connId);
    this.nodesById.delete(nodeId);
    // 取消所有待处理的调用
    for (const [id, pending] of this.pendingInvokes.entries()) {
      if (pending.nodeId !== nodeId) continue;
      clearTimeout(pending.timer);
      pending.reject(new Error(`node disconnected (${pending.command})`));
      this.pendingInvokes.delete(id);
    }
    return nodeId;
  }

  // 列出连接的节点
  listConnected(): NodeSession[] {
    return [...this.nodesById.values()];
  }

  // 获取节点
  get(nodeId: string): NodeSession | undefined {
    return this.nodesById.get(nodeId);
  }
}
#+END_SRC

** 11.3 Node 调用机制

调用节点命令是异步的，带超时：

#+BEGIN_SRC typescript
// src/gateway/node-registry.ts
async invoke(params: {
  nodeId: string;
  command: string;
  params?: unknown;
  timeoutMs?: number;
  idempotencyKey?: string;
}): Promise<NodeInvokeResult> {
  const node = this.nodesById.get(params.nodeId);
  if (!node) {
    return { ok: false, error: { code: "NOT_CONNECTED", message: "node not connected" } };
  }

  const requestId = randomUUID();
  const payload = {
    id: requestId,
    nodeId: params.nodeId,
    command: params.command,
    paramsJSON: "params" in params && params.params !== undefined
      ? JSON.stringify(params.params)
      : null,
    timeoutMs: params.timeoutMs,
    idempotencyKey: params.idempotencyKey,
  };

  const ok = this.sendEventToSession(node, "node.invoke.request", payload);
  if (!ok) {
    return { ok: false, error: { code: "UNAVAILABLE", message: "failed to send invoke to node" } };
  }

  const timeoutMs = typeof params.timeoutMs === "number" ? params.timeoutMs : 30_000;
  return await new Promise<NodeInvokeResult>((resolve, reject) => {
    const timer = setTimeout(() => {
      this.pendingInvokes.delete(requestId);
      resolve({ ok: false, error: { code: "TIMEOUT", message: "node invoke timed out" } });
    }, timeoutMs);
    this.pendingInvokes.set(requestId, {
      nodeId: params.nodeId,
      command: params.command,
      resolve,
      reject,
      timer,
    });
  });
}
#+END_SRC

调用流程：
1. 生成 requestId
2. 发送 =node.invoke.request= 事件到节点
3. 等待 =node.invoke.result= 事件回来
4. 超时自动 reject

