docs/openclaw3.html
<div id="outline-container-orgd0b8637" class="outline-3">
<h3 id="orgd0b8637"><span class="section-number-3">2.2.</span> 10.2 调度计算</h3>
<div class="outline-text-3" id="text-2-2">
<p>
我看了 <code>src/cron/schedule.ts=，里面的 =computeNextRunAtMs</code> 函数负责计算下次执行时间：
</p>

<div class="org-src-container">
<pre class="src src-typescript">// src/cron/schedule.ts
export function computeNextRunAtMs(
  schedule: CronSchedule,
  nowMs: number
): number | undefined {
  if (schedule.kind === "at") {
    // 一次性任务：解析时间，检查是否在未来
    const atMs = parseAbsoluteTimeMs(schedule.at);
    return atMs &gt; nowMs ? atMs : undefined;
  }

  if (schedule.kind === "every") {
    // 固定间隔：计算下一个间隔点
    const everyMs = Math.max(1, Math.floor(schedule.everyMs));
    const anchor = Math.max(0, Math.floor(schedule.anchorMs ?? nowMs));
    if (nowMs &lt; anchor) return anchor;
    const elapsed = nowMs - anchor;
    const steps = Math.max(1, Math.floor((elapsed + everyMs - 1) / everyMs));
    return anchor + steps * everyMs;
  }

  // Cron 表达式：用 croner 库解析
  const expr = schedule.expr.trim();
  const cron = new Cron(expr, {
    timezone: resolveCronTimezone(schedule.tz),
    catch: false,
  });
  const nowSecondMs = Math.floor(nowMs / 1000) * 1000;
  const next = cron.nextRun(new Date(nowSecondMs));
  const nextMs = next?.getTime();
  return Number.isFinite(nextMs) &amp;&amp; nextMs &gt; nowSecondMs ? nextMs : undefined;
}
</pre>
</div>

<p>
注意那个 timezone 处理——cron 任务支持时区，这很重要。
</p>
</div>
</div>
<div id="outline-container-org7bec824" class="outline-3">
<h3 id="org7bec824"><span class="section-number-3">2.3.</span> 10.3 Cron 服务架构</h3>
<div class="outline-text-3" id="text-2-3">
<p>
CronService 是定时任务的核心类：
</p>

<div class="org-src-container">
<pre class="src src-typescript">// src/cron/service.ts
export class CronService {
  private readonly state;

  constructor(deps: CronServiceDeps) {
    this.state = createCronServiceState(deps);
  }

  async start() { await ops.start(this.state); }
  stop() { ops.stop(this.state); }
  async status() { return await ops.status(this.state); }
  async list(opts?: { includeDisabled?: boolean }) {
    return await ops.list(this.state, opts);
  }
  async add(input: CronJobCreate) { return await ops.add(this.state, input); }
  async update(id: string, patch: CronJobPatch) {
    return await ops.update(this.state, id, patch);
  }
  async remove(id: string) { return await ops.remove(this.state, id); }
  async run(id: string, mode?: "due" | "force") {
    return await ops.run(this.state, id, mode);
  }
  wake(opts: { mode: "now" | "next-heartbeat"; text: string }) {
    return ops.wakeNow(this.state, opts);
  }
}
</pre>
</div>

<p>
设计很清晰：
</p>
<ul class="org-ul">
<li>=state=：封装内部状态</li>
<li>=ops=：具体操作函数（start/stop/list/add/update/remove/run）</li>
<li>分离关注点，状态和操作分开</li>
</ul>
</div>
</div>
<div id="outline-container-org8f0782d" class="outline-3">
<h3 id="org8f0782d"><span class="section-number-3">2.4.</span> 10.4 定时任务的数据结构</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-typescript">// src/cron/types.ts
export type CronJob = {
  id: string;
  name?: string;
  description?: string;
  schedule: CronSchedule;
  nextRunAtMs?: number;
  lastRunAtMs?: number;
  lastError?: string;
  enabled: boolean;
  createdAtMs: number;
  updatedAtMs: number;
  // 任务内容
  agentId?: string;
  prompt?: string;
  // ...
};
</pre>
</div>

<p>
任务触发时，会创建一个隔离的 agent session，执行指定的 prompt。
</p>
</div>
</div>
<div id="outline-container-org8a401ca" class="outline-3">
<h3 id="org8a401ca"><span class="section-number-3">2.5.</span> 10.5 Gateway 集成</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Cron 服务通过 Gateway 暴露 API：
</p>

<ul class="org-ul">
<li>=src/gateway/server-cron.ts=：HTTP 端点</li>
<li>=src/gateway/server-methods/cron.ts=：方法处理</li>
<li>=src/gateway/protocol/schema/cron.ts=：协议 schema</li>
</ul>

<p>
还有专门的 CLI：=src/cli/cron-cli.ts=
</p>
</div>
</div>
</div>
<div id="outline-container-org69b7741" class="outline-2">
<h2 id="org69b7741"><span class="section-number-2">3.</span> 第11章 节点系统（Nodes）</h2>
<div class="outline-text-2" id="text-3">
<p>
Node 系统是 OpenClaw 一个很有意思的设计——它允许远程设备（比如手机、平板）连接到 OpenClaw，提供额外的能力。
</p>
</div>
<div id="outline-container-org525b26f" class="outline-3">
<h3 id="org525b26f"><span class="section-number-3">3.1.</span> 11.1 什么是 Node？</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Node 是通过 WebSocket 连接到 Gateway 的远程客户端，可以：
</p>
<ul class="org-ul">
<li>提供本地功能（摄像头、屏幕、麦克风）</li>
<li>执行本地命令</li>
<li>推送事件给 OpenClaw</li>
</ul>

<p>
比如你有个手机 App 连到 OpenClaw，AI 就可以通过这个 Node 调用手机摄像头拍照。
</p>
</div>
</div>
<div id="outline-container-org25e1f6c" class="outline-3">
<h3 id="org25e1f6c"><span class="section-number-3">3.2.</span> 11.2 Node 注册表</h3>
<div class="outline-text-3" id="text-3-2">
<p>
NodeRegistry 管理所有连接的节点：
</p>

<div class="org-src-container">
<pre class="src src-typescript">// src/gateway/node-registry.ts
export class NodeRegistry {
  private nodesById = new Map&lt;string, NodeSession&gt;();
  private nodesByConn = new Map&lt;string, string&gt;();
  private pendingInvokes = new Map&lt;string, PendingInvoke&gt;();

  // 注册新节点
  register(client: GatewayWsClient, opts: { remoteIp?: string }) {
    const nodeId = connect.device?.id ?? connect.client.id;
    const session: NodeSession = {
      nodeId,
      connId: client.connId,
      client,
      displayName: connect.client.displayName,
      platform: connect.client.platform,
      version: connect.client.version,
      caps: Array.isArray(connect.caps) ? connect.caps : [],
      commands: Array.isArray((connect as { commands?: string[] }).commands)
        ? ((connect as { commands?: string[] }).commands ?? [])
        : [],
      permissions: (connect as { permissions?: Record&lt;string, boolean&gt; }).permissions,
      pathEnv: (connect as { pathEnv?: string }).pathEnv,
      connectedAtMs: Date.now(),
    };
    this.nodesById.set(nodeId, session);
    this.nodesByConn.set(client.connId, nodeId);
    return session;
  }

  // 注销节点
  unregister(connId: string): string | null {
    const nodeId = this.nodesByConn.get(connId);
    if (!nodeId) return null;
    this.nodesByConn.delete(connId);
    this.nodesById.delete(nodeId);
    // 取消所有待处理的调用
    for (const [id, pending] of this.pendingInvokes.entries()) {
      if (pending.nodeId !== nodeId) continue;
      clearTimeout(pending.timer);
      pending.reject(new Error(`node disconnected (${pending.command})`));
      this.pendingInvokes.delete(id);
    }
    return nodeId;
  }

  // 列出连接的节点
  listConnected(): NodeSession[] {
    return [...this.nodesById.values()];
  }

  // 获取节点
  get(nodeId: string): NodeSession | undefined {
    return this.nodesById.get(nodeId);
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbae8d42" class="outline-3">
<h3 id="orgbae8d42"><span class="section-number-3">3.3.</span> 11.3 Node 调用机制</h3>
<div class="outline-text-3" id="text-3-3">
<p>
调用节点命令是异步的，带超时：
</p>

<div class="org-src-container">
<pre class="src src-typescript">// src/gateway/node-registry.ts
async invoke(params: {
  nodeId: string;
  command: string;
  params?: unknown;
  timeoutMs?: number;
  idempotencyKey?: string;
}): Promise&lt;NodeInvokeResult&gt; {
  const node = this.nodesById.get(params.nodeId);
  if (!node) {
    return { ok: false, error: { code: "NOT_CONNECTED", message: "node not connected" } };
  }

  const requestId = randomUUID();
  const payload = {
    id: requestId,
    nodeId: params.nodeId,
    command: params.command,
    paramsJSON: "params" in params &amp;&amp; params.params !== undefined
      ? JSON.stringify(params.params)
      : null,
    timeoutMs: params.timeoutMs,
    idempotencyKey: params.idempotencyKey,
  };

  const ok = this.sendEventToSession(node, "node.invoke.request", payload);
  if (!ok) {
    return { ok: false, error: { code: "UNAVAILABLE", message: "failed to send invoke to node" } };
  }

  const timeoutMs = typeof params.timeoutMs === "number" ? params.timeoutMs : 30_000;
  return await new Promise&lt;NodeInvokeResult&gt;((resolve, reject) =&gt; {
    const timer = setTimeout(() =&gt; {
      this.pendingInvokes.delete(requestId);
      resolve({ ok: false, error: { code: "TIMEOUT", message: "node invoke timed out" } });
    }, timeoutMs);
    this.pendingInvokes.set(requestId, {
      nodeId: params.nodeId,
      command: params.command,
      resolve,
      reject,
      timer,
    });
  });
}
</pre>
</div>

<p>
调用流程：
</p>
<ol class="org-ol">
<li>生成 requestId</li>
<li>发送 <code>node.invoke.request</code> 事件到节点</li>
<li>等待 <code>node.invoke.result</code> 事件回来</li>
<li>超时自动 reject</li>
</ol>
</div>
</div>
