orgs/openclaw3.org
** 11.4 Node 能力（Capabilities）

节点连接时会声明自己的能力（caps）：

#+BEGIN_SRC typescript
// 常见的 capabilities
"screen"      // 屏幕共享/截图
"camera"      // 摄像头
"microphone"  // 麦克风
"canvas"      // 画布操作
"shell"       // 执行 shell 命令
"filesystem"  // 文件系统访问
// ...
#+END_SRC

AI 可以通过这些能力来调用节点功能。

** 11.5 Node 事件系统

节点和 Gateway 之间是双向通信的：

- Gateway → Node：调用命令（=node.invoke.request=）
- Node → Gateway：返回结果（=node.invoke.result=）
- Node → Gateway：推送事件（比如传感器数据）

相关文件：
- =src/gateway/server-node-events.ts=：节点事件处理
- =src/gateway/server-node-subscriptions.ts=：节点订阅管理

* 第12章 配置系统

OpenClaw 的配置系统设计得很完善，支持多层级、验证、迁移、环境变量替换等。

** 12.1 配置文件格式

配置文件是 JSON5 格式（不是纯 JSON），支持注释、尾随逗号等：

#+BEGIN_SRC json5
// openclaw.json5
{
  // 模型配置
  models: {
    default: "claude-3-5-sonnet",
    providers: {
      anthropic: {
        apiKey: "${ANTHROPIC_API_KEY}",
      },
    },
  },

  // 会话配置
  session: {
    scope: "per-sender",
    resetPolicy: {
      kind: "daily",
      time: "04:00",
    },
  },

  // 渠道配置
  channels: {
    whatsapp: {
      // ...
    },
  },
}
#+END_SRC

** 12.2 配置类型定义

OpenClawConfig 是根类型，结构非常清晰：

#+BEGIN_SRC typescript
// src/config/types.openclaw.ts
export type OpenClawConfig = {
  meta?: {
    lastTouchedVersion?: string;
    lastTouchedAt?: string;
  };
  auth?: AuthConfig;
  env?: {
    shellEnv?: { enabled?: boolean; timeoutMs?: number };
    vars?: Record<string, string>;
  };
  logging?: LoggingConfig;
  update?: { channel?: "stable" | "beta" | "dev"; checkOnStart?: boolean };
  browser?: BrowserConfig;
  ui?: {
    seamColor?: string;
    assistant?: { name?: string; avatar?: string };
  };
  skills?: SkillsConfig;
  plugins?: PluginsConfig;
  models?: ModelsConfig;
  nodeHost?: NodeHostConfig;
  agents?: AgentsConfig;
  tools?: ToolsConfig;
  bindings?: AgentBinding[];
  broadcast?: BroadcastConfig;
  audio?: AudioConfig;
  messages?: MessagesConfig;
  commands?: CommandsConfig;
  approvals?: ApprovalsConfig;
  session?: SessionConfig;
  web?: WebConfig;
  channels?: ChannelsConfig;
  cron?: CronConfig;
  hooks?: HooksConfig;
  discovery?: DiscoveryConfig;
  canvasHost?: CanvasHostConfig;
  talk?: TalkConfig;
  gateway?: GatewayConfig;
  memory?: MemoryConfig;
};
#+END_SRC

每个子配置都在单独的文件里：
- =types.agents.ts=
- =types.auth.ts=
- =types.channels.ts=
- =types.cron.ts=
- =types.models.ts=
- ... 等等

** 12.3 配置加载流程

配置加载不是简单的 =JSON.parse=，而是一个完整的 pipeline：

1. 读取原始文件
2. 解析 JSON5
3. 解析 =$include= 指令（包含其他配置文件）
4. 替换 =${ENV_VAR}= 环境变量
5. 应用运行时覆盖
6. 应用默认值
7. 验证配置
8. 迁移旧版本配置

相关文件：
- =src/config/io.ts=：文件读写
- =src/config/includes-scan.ts=：= $include= 处理
- =src/config/env-substitution.ts=：环境变量替换
- =src/config/merge-config.ts=：合并配置
- =src/config/legacy-migrate.ts=：旧配置迁移
- =src/config/validation.ts=：配置验证

** 12.4 配置验证

用 Zod 做 schema 验证：

#+BEGIN_SRC typescript
// src/config/zod-schema.ts（节选）
export const OpenClawSchema = z.object({
  meta: z.object({
    lastTouchedVersion: z.string().optional(),
    lastTouchedAt: z.string().optional(),
  }).optional(),

  session: z.object({
    scope: z.enum(["per-sender", "per-channel", "per-group"]).optional(),
    mainKey: z.string().optional(),
    store: z.string().optional(),
    resetTriggers: z.array(z.string()).optional(),
    // ...
  }).optional(),

  models: z.object({
    default: z.string().optional(),
    providers: z.record(z.object({
      apiKey: z.string().optional(),
      baseUrl: z.string().optional(),
      // ...
    })).optional(),
  }).optional(),

  // ... 更多字段
});
#+END_SRC

验证失败会返回详细的问题列表：

#+BEGIN_SRC typescript
export type ConfigValidationIssue = {
  path: string;
  message: string;
};
#+END_SRC

** 12.5 配置快照

为了安全地修改配置，OpenClaw 用了"快照"的概念：

#+BEGIN_SRC typescript
// src/config/types.openclaw.ts
export type ConfigFileSnapshot = {
  path: string;
  exists: boolean;
  raw: string | null;
  parsed: unknown;
  // 解析后，但在应用默认值之前
  resolved: OpenClawConfig;
  valid: boolean;
  // 最终配置（应用了默认值）
  config: OpenClawConfig;
  hash?: string;
  issues: ConfigValidationIssue[];
  warnings: ConfigValidationIssue[];
  legacyIssues: LegacyConfigIssue[];
};
#+END_SRC

这样可以在写入前预览变更，避免写错配置。

** 12.6 运行时覆盖

配置可以在运行时通过环境变量覆盖：

#+BEGIN_SRC bash
# 覆盖模型提供商的 API key
OPENCLAW__models__providers__anthropic__apiKey=sk-ant-... openclaw
#+END_SRC

格式是 =OPENCLAW__path__to__field=value=。

相关代码在 =src/config/runtime-overrides.ts=。

** 12.7 配置缓存

为了避免反复读取和解析配置，有缓存机制：

#+BEGIN_SRC typescript
// src/config/io.ts
let cachedConfig: OpenClawConfig | undefined;
let cachedConfigPath: string | undefined;

export function clearConfigCache() {
  cachedConfig = undefined;
  cachedConfigPath = undefined;
}

export function loadConfig(...) {
  // 检查缓存是否有效
  // 无效则重新加载
}
#+END_SRC

* 总结

这三部分文档梳理了 OpenClaw 的核心设计：

1. **第一部分（doc.org）**：
   - 项目整体架构
   - Gateway 启动流程
   - HTTP、WebSocket、认证
   - 渠道系统
   - 安全审计

2. **第二部分（doc2.org）**：
   - AI Agent 实现
   - 系统提示词构建
   - Skills 系统
   - Memory 系统
   - 插件系统

3. **第三部分（doc3.org，即本文）**：
   - 会话管理系统
   - 定时任务系统
   - 节点系统
   - 配置系统


INTERESTING.
