docs/openclaw3.html
<div id="outline-container-org5d43811" class="outline-3">
<h3 id="org5d43811"><span class="section-number-3">3.4.</span> 11.4 Node 能力（Capabilities）</h3>
<div class="outline-text-3" id="text-3-4">
<p>
节点连接时会声明自己的能力（caps）：
</p>

<div class="org-src-container">
<pre class="src src-typescript">// 常见的 capabilities
"screen"      // 屏幕共享/截图
"camera"      // 摄像头
"microphone"  // 麦克风
"canvas"      // 画布操作
"shell"       // 执行 shell 命令
"filesystem"  // 文件系统访问
// ...
</pre>
</div>

<p>
AI 可以通过这些能力来调用节点功能。
</p>
</div>
</div>
<div id="outline-container-org7623e05" class="outline-3">
<h3 id="org7623e05"><span class="section-number-3">3.5.</span> 11.5 Node 事件系统</h3>
<div class="outline-text-3" id="text-3-5">
<p>
节点和 Gateway 之间是双向通信的：
</p>

<ul class="org-ul">
<li>Gateway → Node：调用命令（=node.invoke.request=）</li>
<li>Node → Gateway：返回结果（=node.invoke.result=）</li>
<li>Node → Gateway：推送事件（比如传感器数据）</li>
</ul>

<p>
相关文件：
</p>
<ul class="org-ul">
<li>=src/gateway/server-node-events.ts=：节点事件处理</li>
<li>=src/gateway/server-node-subscriptions.ts=：节点订阅管理</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4b4cd4d" class="outline-2">
<h2 id="org4b4cd4d"><span class="section-number-2">4.</span> 第12章 配置系统</h2>
<div class="outline-text-2" id="text-4">
<p>
OpenClaw 的配置系统设计得很完善，支持多层级、验证、迁移、环境变量替换等。
</p>
</div>
<div id="outline-container-org1e5304f" class="outline-3">
<h3 id="org1e5304f"><span class="section-number-3">4.1.</span> 12.1 配置文件格式</h3>
<div class="outline-text-3" id="text-4-1">
<p>
配置文件是 JSON5 格式（不是纯 JSON），支持注释、尾随逗号等：
</p>

<div class="org-src-container">
<pre class="src src-json5">// openclaw.json5
{
  // 模型配置
  models: {
    default: "claude-3-5-sonnet",
    providers: {
      anthropic: {
        apiKey: "${ANTHROPIC_API_KEY}",
      },
    },
  },

  // 会话配置
  session: {
    scope: "per-sender",
    resetPolicy: {
      kind: "daily",
      time: "04:00",
    },
  },

  // 渠道配置
  channels: {
    whatsapp: {
      // ...
    },
  },
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org00fb9d0" class="outline-3">
<h3 id="org00fb9d0"><span class="section-number-3">4.2.</span> 12.2 配置类型定义</h3>
<div class="outline-text-3" id="text-4-2">
<p>
OpenClawConfig 是根类型，结构非常清晰：
</p>

<div class="org-src-container">
<pre class="src src-typescript">// src/config/types.openclaw.ts
export type OpenClawConfig = {
  meta?: {
    lastTouchedVersion?: string;
    lastTouchedAt?: string;
  };
  auth?: AuthConfig;
  env?: {
    shellEnv?: { enabled?: boolean; timeoutMs?: number };
    vars?: Record&lt;string, string&gt;;
  };
  logging?: LoggingConfig;
  update?: { channel?: "stable" | "beta" | "dev"; checkOnStart?: boolean };
  browser?: BrowserConfig;
  ui?: {
    seamColor?: string;
    assistant?: { name?: string; avatar?: string };
  };
  skills?: SkillsConfig;
  plugins?: PluginsConfig;
  models?: ModelsConfig;
  nodeHost?: NodeHostConfig;
  agents?: AgentsConfig;
  tools?: ToolsConfig;
  bindings?: AgentBinding[];
  broadcast?: BroadcastConfig;
  audio?: AudioConfig;
  messages?: MessagesConfig;
  commands?: CommandsConfig;
  approvals?: ApprovalsConfig;
  session?: SessionConfig;
  web?: WebConfig;
  channels?: ChannelsConfig;
  cron?: CronConfig;
  hooks?: HooksConfig;
  discovery?: DiscoveryConfig;
  canvasHost?: CanvasHostConfig;
  talk?: TalkConfig;
  gateway?: GatewayConfig;
  memory?: MemoryConfig;
};
</pre>
</div>

<p>
每个子配置都在单独的文件里：
</p>
<ul class="org-ul">
<li><code>types.agents.ts</code></li>
<li><code>types.auth.ts</code></li>
<li><code>types.channels.ts</code></li>
<li><code>types.cron.ts</code></li>
<li><code>types.models.ts</code></li>
<li>&#x2026; 等等</li>
</ul>
</div>
</div>
<div id="outline-container-org138a54e" class="outline-3">
<h3 id="org138a54e"><span class="section-number-3">4.3.</span> 12.3 配置加载流程</h3>
<div class="outline-text-3" id="text-4-3">
<p>
配置加载不是简单的 =JSON.parse=，而是一个完整的 pipeline：
</p>

<ol class="org-ol">
<li>读取原始文件</li>
<li>解析 JSON5</li>
<li>解析 <code>$include</code> 指令（包含其他配置文件）</li>
<li>替换 <code>${ENV_VAR}</code> 环境变量</li>
<li>应用运行时覆盖</li>
<li>应用默认值</li>
<li>验证配置</li>
<li>迁移旧版本配置</li>
</ol>

<p>
相关文件：
</p>
<ul class="org-ul">
<li>=src/config/io.ts=：文件读写</li>
<li><code>src/config/includes-scan.ts=：</code> $include= 处理</li>
<li>=src/config/env-substitution.ts=：环境变量替换</li>
<li>=src/config/merge-config.ts=：合并配置</li>
<li>=src/config/legacy-migrate.ts=：旧配置迁移</li>
<li>=src/config/validation.ts=：配置验证</li>
</ul>
</div>
</div>
<div id="outline-container-org80fc570" class="outline-3">
<h3 id="org80fc570"><span class="section-number-3">4.4.</span> 12.4 配置验证</h3>
<div class="outline-text-3" id="text-4-4">
<p>
用 Zod 做 schema 验证：
</p>

<div class="org-src-container">
<pre class="src src-typescript">// src/config/zod-schema.ts（节选）
export const OpenClawSchema = z.object({
  meta: z.object({
    lastTouchedVersion: z.string().optional(),
    lastTouchedAt: z.string().optional(),
  }).optional(),

  session: z.object({
    scope: z.enum(["per-sender", "per-channel", "per-group"]).optional(),
    mainKey: z.string().optional(),
    store: z.string().optional(),
    resetTriggers: z.array(z.string()).optional(),
    // ...
  }).optional(),

  models: z.object({
    default: z.string().optional(),
    providers: z.record(z.object({
      apiKey: z.string().optional(),
      baseUrl: z.string().optional(),
      // ...
    })).optional(),
  }).optional(),

  // ... 更多字段
});
</pre>
</div>

<p>
验证失败会返回详细的问题列表：
</p>

<div class="org-src-container">
<pre class="src src-typescript">export type ConfigValidationIssue = {
  path: string;
  message: string;
};
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc0535bd" class="outline-3">
<h3 id="orgc0535bd"><span class="section-number-3">4.5.</span> 12.5 配置快照</h3>
<div class="outline-text-3" id="text-4-5">
<p>
为了安全地修改配置，OpenClaw 用了"快照"的概念：
</p>

<div class="org-src-container">
<pre class="src src-typescript">// src/config/types.openclaw.ts
export type ConfigFileSnapshot = {
  path: string;
  exists: boolean;
  raw: string | null;
  parsed: unknown;
  // 解析后，但在应用默认值之前
  resolved: OpenClawConfig;
  valid: boolean;
  // 最终配置（应用了默认值）
  config: OpenClawConfig;
  hash?: string;
  issues: ConfigValidationIssue[];
  warnings: ConfigValidationIssue[];
  legacyIssues: LegacyConfigIssue[];
};
</pre>
</div>

<p>
这样可以在写入前预览变更，避免写错配置。
</p>
</div>
</div>
<div id="outline-container-org6f8449e" class="outline-3">
<h3 id="org6f8449e"><span class="section-number-3">4.6.</span> 12.6 运行时覆盖</h3>
<div class="outline-text-3" id="text-4-6">
<p>
配置可以在运行时通过环境变量覆盖：
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #96a0aa;"># </span><span style="color: #96a0aa;">&#35206;&#30422;&#27169;&#22411;&#25552;&#20379;&#21830;&#30340; API key
</span><span style="color: #ffc9e8;">OPENCLAW__models__providers__anthropic__apiKey</span>=sk-ant-... openclaw
</pre>
</div>

<p>
格式是 =OPENCLAW__path__to__field=value=。
</p>

<p>
相关代码在 =src/config/runtime-overrides.ts=。
</p>
</div>
</div>
<div id="outline-container-org19a6a92" class="outline-3">
<h3 id="org19a6a92"><span class="section-number-3">4.7.</span> 12.7 配置缓存</h3>
<div class="outline-text-3" id="text-4-7">
<p>
为了避免反复读取和解析配置，有缓存机制：
</p>

<div class="org-src-container">
<pre class="src src-typescript">// src/config/io.ts
let cachedConfig: OpenClawConfig | undefined;
let cachedConfigPath: string | undefined;

export function clearConfigCache() {
  cachedConfig = undefined;
  cachedConfigPath = undefined;
}

export function loadConfig(...) {
  // 检查缓存是否有效
  // 无效则重新加载
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0729229" class="outline-2">
<h2 id="org0729229"><span class="section-number-2">5.</span> 总结</h2>
<div class="outline-text-2" id="text-5">
<p>
这三部分文档梳理了 OpenClaw 的核心设计：
</p>

<ol class="org-ol">
<li>**第一部分（doc.org）**：
<ul class="org-ul">
<li>项目整体架构</li>
<li>Gateway 启动流程</li>
<li>HTTP、WebSocket、认证</li>
<li>渠道系统</li>
<li>安全审计</li>
</ul></li>

<li>**第二部分（doc2.org）**：
<ul class="org-ul">
<li>AI Agent 实现</li>
<li>系统提示词构建</li>
<li>Skills 系统</li>
<li>Memory 系统</li>
<li>插件系统</li>
</ul></li>

<li>**第三部分（doc3.org，即本文）**：
<ul class="org-ul">
<li>会话管理系统</li>
<li>定时任务系统</li>
<li>节点系统</li>
<li>配置系统</li>
</ul></li>
</ol>


<p>
INTERESTING.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr class="Solid"> <div class="info"> <span class="author">Author: Zi Liang (<a href="mailto:zi1415926.liang@connect.polyu.hk">zi1415926.liang@connect.polyu.hk</a>)</span> <span class="date">Create Date: Thu Feb 19 18:30:07 2026</span> <span class="date">Last modified: 2026-02-26 Thu 09:11</span> <span>Creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</span> </div>
</div>
</body>
</html>
